{
  "direct_tweets": [
    {
      "date": "2018-01-28 13:18:33",
      "text": "Our economy is better than it has been in many decades. Businesses are coming back to America like never before. Chrysler, as an example, is leaving Mexico and coming back to the USA. Unemployment is nearing record lows. We are on the right track!"
    },
    {
      "date": "2018-01-28 13:18:32",
      "text": "Somebody please inform Jay-Z that because of my policies, Black Unemployment has just been reported to be at the LOWEST RATE EVER RECORDED!"
    },
    {
      "date": "2018-01-28 04:08:02",
      "text": "Democrats are not interested in Border Safety &amp; Security or in the funding and rebuilding of our Military. They are only interested in Obstruction!"
    },
    {
      "date": "2018-01-28 03:58:02",
      "text": "I have offered DACA a wonderful deal, including a doubling in the number of recipients &amp; a twelve year pathway to citizenship, for two reasons: (1) Because the Republicans want to fix a long time terrible problem. (2) To show that Democrats do not want to solve DACA, only use it!"
    },
    {
      "date": "2018-01-27 22:59:52",
      "text": "Taliban targeted innocent Afghans, brave police in Kabul today. Our thoughts and prayers go to the victims, and first responders. We will not allow the Taliban to win!"
    },
    {
      "date": "2018-01-27 19:30:24",
      "text": "On Holocaust Remembrance Day we mourn and grieve the murder of 6 million innocent Jewish men, women and children, and the millions of others who perished in the evil Nazi Genocide. We pledge with all of our might and resolve: Never Again! https://t.co/PfHM7UiZ0C https://t.co/25W0SZHTOu"
    },
    {
      "date": "2018-01-27 11:55:58",
      "text": "Thank you to Brandon Judd of the National Border Patrol Council for his strong statement on that we very badly NEED THE WALL. Must also end loophole of “catch &amp; release” and clean up the legal and other procedures at the border NOW for Safety &amp; Security reasons."
    },
    {
      "date": "2018-01-26 23:27:23",
      "text": "Thank you for the wonderful welcome #Davos2018 https://t.co/IQkoQJxR5B"
    },
    {
      "date": "2018-01-26 17:16:44",
      "text": "DACA has been made increasingly difficult by the fact that Cryin' Chuck Schumer took such a beating over the shutdown that he is unable to act on immigration!"
    },
    {
      "date": "2018-01-26 17:12:32",
      "text": "Heading back from a very exciting two days in Davos, Switzerland. Speech on America's economic revival was well received. Many of the people I met will be investing in the U.S.A.! #MAGA"
    },
    {
      "date": "2018-01-26 12:54:36",
      "text": "Join me live at the 2018 World Economic Forum in Davos, Switzerland! #WEF18 https://t.co/fdHejCmv73 https://t.co/DuKJlVTWB8"
    },
    {
      "date": "2018-01-26 11:23:07",
      "text": "Great bilateral meeting with President of the Swiss Confederation - as we continue to strengthen our great friendship. Such an honor to be in Switzerland! #WEF18 https://t.co/87pLrCpQkZ"
    },
    {
      "date": "2018-01-26 10:46:48",
      "text": "It was an honor to meet with Republic of Rwanda President Paul Kagame this morning in Davos, Switzerland. Many great discussions! #WEF18 https://t.co/SaPzwVhDiB"
    },
    {
      "date": "2018-01-26 10:11:26",
      "text": "Will be interviewed on  by coming up at 6:00amE from Davos, Switzerland. Enjoy! #WEF18 https://t.co/7egYlxnFBd"
    },
    {
      "date": "2018-01-25 22:38:21",
      "text": "Today, Americans everywhere remember the brave men and women of who lost their lives in our Nation's eternal quest to expand the boundaries of human potential. https://t.co/clBsJTGz8B https://t.co/jTJkusdBQA"
    },
    {
      "date": "2018-01-25 18:03:29",
      "text": "Very productive bilateral meeting with Prime Minister Benjamin of Israel - in Davos, Switzerland! #WEF18 https://t.co/2sZM9YI7tJ"
    },
    {
      "date": "2018-01-25 17:25:53",
      "text": "Great bilateral meeting with Prime Minister Theresa May of the United Kingdom, affirming the special relationship and our commitment to work together on key national security challenges and economic opportunities. #WEF18 https://t.co/FPP8aRDAyt"
    },
    {
      "date": "2018-01-25 00:27:00",
      "text": "Will soon be heading to Davos, Switzerland, to tell the world how great America is and is doing. Our economy is now booming and with all I am doing, will only get better...Our country is finally WINNING again!"
    },
    {
      "date": "2018-01-24 22:51:20",
      "text": "It was my great honor to welcome Mayor's from across America to the WH. My Administration will always support local government - and listen to the leaders who know their communities best. Together, we will usher in a bold new era of Peace and Prosperity! https://t.co/dmYECTnk0a https://t.co/RSv7V7r0DT"
    },
    {
      "date": "2018-01-24 20:26:16",
      "text": "Earlier today, I spoke with of Kentucky regarding yesterday's shooting at Marshall County High School. My thoughts and prayers are with Bailey Holt, Preston Cope, their families, and all of the wounded victims who are in recovery. We are with you!"
    },
    {
      "date": "2018-01-24 11:58:58",
      "text": "Tremendous investment by companies from all over the world being made in America. There has never been anything like it. Now Disney, J.P. Morgan Chase and many others. Massive Regulation Reduction and Tax Cuts are making us a powerhouse again. Long way to go! Jobs, Jobs, Jobs!"
    },
    {
      "date": "2018-01-24 04:07:27",
      "text": "Cryin' Chuck Schumer fully understands, especially after his humiliating defeat, that if there is no Wall, there is no DACA. We must have safety and security, together with a strong Military, for our great people!"
    },
    {
      "date": "2018-01-24 03:54:22",
      "text": "Where are the 50,000 important text messages between FBI lovers Lisa Page and Peter Strzok?  Blaming Samsung!"
    },
    {
      "date": "2018-01-23 14:16:02",
      "text": "Thank you to General John Kelly, who is doing a fantastic job, and all of the Staff and others in the White House, for a job well done. Long hours and Fake reporting makes your job more difficult, but it is always great to WIN, and few have won more than us!"
    },
    {
      "date": "2018-01-23 13:34:37",
      "text": "Nobody knows for sure that the Republicans &amp; Democrats will be able to reach a deal on DACA by February 8, but everyone will be trying....with a big additional focus put on Military Strength and Border Security. The Dems have just learned that a Shutdown is not the answer!"
    },
    {
      "date": "2018-01-23 11:55:42",
      "text": "In one of the biggest stories in a long time, the FBI now says it is missing five months worth of lovers Strzok-Page texts, perhaps 50,000, and all in prime time. Wow!"
    },
    {
      "date": "2018-01-23 11:31:40",
      "text": "Even Crazy Jim Acosta of Fake News CNN agrees: “Trump World and WH sources dancing in end zone: Trump wins again...Schumer and Dems caved...gambled and lost.” Thank you for your honesty Jim!"
    },
    {
      "date": "2018-01-23 04:30:33",
      "text": "Big win for Republicans as Democrats cave on Shutdown. Now I want a big win for everyone, including Republicans, Democrats and DACA, but especially for our Great Military and Border Security. Should be able to get there. See you at the negotiating table!"
    },
    {
      "date": "2018-01-22 15:13:18",
      "text": "End the Democrats Obstruction! https://t.co/tzBXilvW1b"
    },
    {
      "date": "2018-01-22 13:15:55",
      "text": "Democrats have shut down our government in the interests of their far left base. They don't want to do it but are powerless!"
    },
    {
      "date": "2018-01-22 13:07:09",
      "text": "The Democrats are turning down services and security for citizens in favor of services and security for non-citizens. Not good!"
    },
    {
      "date": "2018-01-22 01:21:42",
      "text": "Thank you to Brad Blakeman on for grading year one of my presidency with an “A”-and likewise to Doug Schoen for the very good grade and statements. Working hard!"
    },
    {
      "date": "2018-01-21 12:35:28",
      "text": "Great to see how hard Republicans are fighting for our Military and Safety at the Border. The Dems just want illegal immigrants to pour into our nation unchecked. If stalemate continues, Republicans should go to 51% (Nuclear Option) and vote on real, long term budget, no C.R.'s!"
    },
    {
      "date": "2018-01-21 02:18:51",
      "text": "Eric Trump on on now!"
    },
    {
      "date": "2018-01-21 00:47:40",
      "text": "The Trump Administration has terminated more UNNECESSARY Regulation, in just twelve months, than any other Administration has terminated during their full term in office, no matter what the length. The good news is, THERE IS MUCH MORE TO COME!"
    },
    {
      "date": "2018-01-20 22:31:27",
      "text": "Unprecedented success for our Country, in so many ways, since the Election. Record Stock Market, Strong on Military, Crime, Borders, &amp; ISIS, Judicial Strength &amp; Numbers, Lowest Unemployment for Women &amp; ALL, Massive Tax Cuts, end of Individual Mandate - and so much more. Big 2018!"
    },
    {
      "date": "2018-01-20 18:51:24",
      "text": "Beautiful weather all over our great country, a perfect day for all Women to March. Get out there now to celebrate the historic milestones and unprecedented economic success and wealth creation that has taken place over the last 12 months. Lowest female unemployment in 18 years!"
    },
    {
      "date": "2018-01-20 14:27:54",
      "text": "Democrats are holding our Military hostage over their desire to have unchecked illegal immigration. Can't let that happen!"
    },
    {
      "date": "2018-01-20 11:47:42",
      "text": "#AMERICA FIRST!"
    },
    {
      "date": "2018-01-20 11:44:01",
      "text": "For those asking, the Republicans only have 51 votes in the Senate, and they need 60. That is why we need to win more Republicans in 2018 Election! We can then be even tougher on  Crime (and Border), and even better to our Military &amp; Veterans!"
    },
    {
      "date": "2018-01-20 11:33:35",
      "text": "This is the One Year Anniversary of my Presidency and the Democrats wanted to give me a nice present. #DemocratShutdown"
    },
    {
      "date": "2018-01-20 11:17:10",
      "text": "Democrats are far more concerned with Illegal Immigrants than they are with our great Military or Safety at our dangerous Southern Border. They could have easily made a deal but decided to play Shutdown politics instead. #WeNeedMoreRepublicansIn18 in order to power through mess!"
    },
    {
      "date": "2018-01-20 02:28:56",
      "text": "Not looking good for our great Military or Safety &amp; Security on the very dangerous Southern Border. Dems want a Shutdown in order to help diminish the great success of the Tax Cuts, and what they are doing for our booming economy."
    },
    {
      "date": "2018-01-19 22:17:53",
      "text": "Excellent preliminary meeting in Oval with - working on solutions for Security and our great Military together with McConnell and Making progress - four week extension would be best!"
    },
    {
      "date": "2018-01-19 20:53:17",
      "text": "Just signed 702 Bill to reauthorize foreign intelligence collection. This is NOT the same FISA law that was so wrongly abused during the election. I will always do the right thing for our country and put the safety of the American people first!"
    },
    {
      "date": "2018-01-19 18:39:50",
      "text": "Today, I was honored and proud to address the 45th Annual You are living witnesses of this year's March for Life theme: #LoveSavesLives. https://t.co/DMST4qhDmp"
    },
    {
      "date": "2018-01-19 16:28:29",
      "text": "“Shutting down the government is a very serious thing. People die, accidents happen. I don't know how I would vote right now on a CR, OK?”\nSen. Dianne Feinstein (D-Calif)\nhttps://t.co/7xP3CBnv5j"
    },
    {
      "date": "2018-01-19 16:14:05",
      "text": ".Briefing with Director Marc Short and Director Mick Mulvaney...\nhttps://t.co/0O0VsYXmHB"
    },
    {
      "date": "2018-01-19 12:04:47",
      "text": "Government Funding Bill past last night in the House of Representatives. Now Democrats are needed if it is to pass in the Senate - but they want illegal immigration and weak borders. Shutdown coming? We need more Republican victories in 2018!"
    },
    {
      "date": "2018-01-18 23:39:53",
      "text": "House of Representatives needs to pass Government Funding Bill tonight. So important for our country - our Military needs it!"
    },
    {
      "date": "2018-01-18 21:04:36",
      "text": "AMERICA will once again be a NATION that thinks big, dreams bigger, and always reaches for the stars. YOU are the ones who will shape America's destiny. YOU are the ones who will restore our prosperity. And YOU are the ones who are MAKING AMERICA GREAT AGAIN! #MAGA https://t.co/f2abNK47II"
    },
    {
      "date": "2018-01-18 20:45:33",
      "text": "Departing Pittsburgh now, where it was my great honor to stand with our incredible workers, and to show the world that AMERICA is back - and we are coming back bigger and better and stronger than ever before! https://t.co/kWPgylqFzj"
    },
    {
      "date": "2018-01-18 13:49:11",
      "text": "A government shutdown will be devastating to our military...something the Dems care very little about!"
    },
    {
      "date": "2018-01-18 13:37:24",
      "text": "CHIP should be part of a long term solution, not a 30 Day, or short term, extension!"
    },
    {
      "date": "2018-01-18 13:16:26",
      "text": "We need the Wall for the safety and security of our country. We need the Wall to help stop the massive inflow of drugs from Mexico, now rated the number one most dangerous country in the world. If there is no Wall, there is no Deal!"
    },
    {
      "date": "2018-01-18 12:53:17",
      "text": "Will be going to Pennsylvania today in order to give my total support to RICK SACCONE, running for Congress in a Special Election (March 13). Rick is a great guy. We need more Republicans to continue our already successful agenda!"
    },
    {
      "date": "2018-01-18 11:25:03",
      "text": "....The Wall will be paid for, directly or indirectly, or through longer term reimbursement, by Mexico, which has a ridiculous $71 billion dollar trade surplus with the U.S. The $20 billion dollar Wall is “peanuts” compared to what Mexico makes from the U.S. NAFTA is a bad joke!"
    },
    {
      "date": "2018-01-18 11:15:25",
      "text": "The Wall is the Wall, it has never changed or evolved from the first day I conceived of it. Parts will be, of necessity, see through and it was never intended to be built in areas where there is natural protection such as mountains, wastelands or tough rivers or water....."
    },
    {
      "date": "2018-01-18 01:11:26",
      "text": "ISIS is in retreat, our economy is booming, investments and jobs are pouring back into the country, and so much more! Together there is nothing we can't overcome--even a very biased media. We ARE Making America Great Again!"
    },
    {
      "date": "2018-01-18 01:05:46",
      "text": "Despite some very corrupt and dishonest media coverage, there are many great reporters I respect and lots of GOOD NEWS for the American people to be proud of!"
    },
    {
      "date": "2018-01-18 01:00:05",
      "text": "And the FAKE NEWS winners are...\nhttps://t.co/59G6x2f7fD"
    },
    {
      "date": "2018-01-17 23:36:44",
      "text": "Main Street is BACK! Strongest Holiday Sales bump since the Great Recession -- beating forecasts by BILLIONS OF DOLLARS. https://t.co/kDcGbMieSt"
    },
    {
      "date": "2018-01-17 23:32:58",
      "text": "During the campaign, I promised to MAKE AMERICA GREAT AGAIN by bringing businesses and jobs back to our country. I am very proud to see companies like Chrysler moving operations from Mexico to Michigan where there are so many great American workers! https://t.co/hz2q9UTfnF"
    },
    {
      "date": "2018-01-17 23:28:30",
      "text": "I promised that my policies would allow companies like Apple to bring massive amounts of money back to the United States. Great to see Apple follow through as a result of TAX CUTS. Huge win for American workers and the USA! https://t.co/OwXVUyLOb1"
    },
    {
      "date": "2018-01-17 23:19:02",
      "text": "Today, we witnessed an incredible moment in history – the presentation of Congress' highest civilian honor to our friend, and true AMERICAN HERO, Bob Dole. #CongressionalGoldMedal https://t.co/qNQqDLRmCk"
    },
    {
      "date": "2018-01-17 13:04:46",
      "text": "Eric Trump on  now!"
    },
    {
      "date": "2018-01-16 23:20:10",
      "text": "....we need to keep America safe, including moving away from a random chain migration and lottery system, to one that is merit-based. https://t.co/7PtoSFK1n2"
    },
    {
      "date": "2018-01-16 23:19:39",
      "text": "New report from DOJ &amp; DHS shows that nearly 3 in 4 individuals convicted of terrorism-related charges are foreign-born. We have submitted to Congress a list of resources and reforms...."
    },
    {
      "date": "2018-01-16 20:17:39",
      "text": "Today, it was my honor to welcome President Nursultan Nazarbayev of Kazakhstan to the https://t.co/TerYFZViax"
    }
  ],
  "top_mentions": [
    {
      "num_mentions": 6,
      "profile_picture_url": "https://pbs.twimg.com/profile_images/918480715158716419/4X8oCbge_normal.jpg",
      "user": "@FoxNews"
    },
    {
      "num_mentions": 2,
      "profile_picture_url": "https://pbs.twimg.com/profile_images/952249840884383744/8Xp95_Ip_normal.jpg",
      "user": "@foxandfriends"
    },
    {
      "num_mentions": 2,
      "profile_picture_url": "https://pbs.twimg.com/profile_images/756508063595696128/G6WbhrZB_normal.jpg",
      "user": "@EricTrump"
    },
    {
      "num_mentions": 2,
      "profile_picture_url": "https://pbs.twimg.com/profile_images/822251886988267520/28GpoRsy_normal.jpg",
      "user": "@WhiteHouse"
    },
    {
      "num_mentions": 1,
      "profile_picture_url": "https://pbs.twimg.com/profile_images/859982100904148992/hv5soju7_normal.jpg",
      "user": "@POTUS"
    },
    {
      "num_mentions": 1,
      "profile_picture_url": "https://pbs.twimg.com/profile_images/949025012455038976/RHY5aj1F_normal.jpg",
      "user": "@SpeakerRyan"
    },
    {
      "num_mentions": 1,
      "profile_picture_url": "https://pbs.twimg.com/profile_images/954729053398949890/8NVlCS91_normal.jpg",
      "user": "@alain_berset"
    },
    {
      "num_mentions": 1,
      "profile_picture_url": "https://pbs.twimg.com/profile_images/859913302117318657/0kuQZV0A_normal.jpg",
      "user": "@davidwebbshow"
    },
    {
      "num_mentions": 1,
      "profile_picture_url": "https://pbs.twimg.com/profile_images/564353911473967104/rDqJgxFZ_normal.jpeg",
      "user": "@netanyahu"
    },
    {
      "num_mentions": 1,
      "profile_picture_url": "https://pbs.twimg.com/profile_images/2165187450/JoeKernen_Avatar_425_normal.PNG",
      "user": "@JoeSquawk"
    },
    {
      "num_mentions": 1,
      "profile_picture_url": "https://pbs.twimg.com/profile_images/940948640855674880/48ycUgvr_normal.jpg",
      "user": "@SenSchumer"
    }
  ],
  "images": [
    {
      "date": "2018-01-27 19:30:24",
      "URL": "https://pbs.twimg.com/media/DUkjFmSUMAAjZLM.jpg"
    },
    {
      "date": "2018-01-26 12:54:36",
      "URL": "https://pbs.twimg.com/media/DUd-57vXkAAYgF5.jpg"
    },
    {
      "date": "2018-01-26 11:23:07",
      "URL": "https://pbs.twimg.com/media/DUdp9CPXkAEN17N.jpg"
    },
    {
      "date": "2018-01-26 11:23:07",
      "URL": "https://pbs.twimg.com/media/DUdp9FfXUAAuSaF.jpg"
    },
    {
      "date": "2018-01-26 11:23:07",
      "URL": "https://pbs.twimg.com/media/DUdp9FmW4AAIuui.jpg"
    },
    {
      "date": "2018-01-26 11:23:07",
      "URL": "https://pbs.twimg.com/media/DUdp9CSXUAA6aou.jpg"
    },
    {
      "date": "2018-01-26 10:46:48",
      "URL": "https://pbs.twimg.com/media/DUdhlIIXcAUnZYX.jpg"
    },
    {
      "date": "2018-01-26 10:46:48",
      "URL": "https://pbs.twimg.com/media/DUdhlIfW4AEIGW5.jpg"
    },
    {
      "date": "2018-01-26 10:46:48",
      "URL": "https://pbs.twimg.com/media/DUdhlLPWAAAmdYd.jpg"
    },
    {
      "date": "2018-01-26 10:46:48",
      "URL": "https://pbs.twimg.com/media/DUdhlLRWkAAst6T.jpg"
    },
    {
      "date": "2018-01-26 10:11:26",
      "URL": "https://pbs.twimg.com/media/DUdZh2XXUAEJWiN.jpg"
    },
    {
      "date": "2018-01-26 10:11:26",
      "URL": "https://pbs.twimg.com/media/DUdZhy4W0AAus_Y.jpg"
    },
    {
      "date": "2018-01-26 10:11:26",
      "URL": "https://pbs.twimg.com/media/DUdZhy9WkAUibWh.jpg"
    },
    {
      "date": "2018-01-25 18:03:29",
      "URL": "https://pbs.twimg.com/media/DUZ8AfzW4AUZW8Y.jpg"
    },
    {
      "date": "2018-01-25 18:03:29",
      "URL": "https://pbs.twimg.com/media/DUZ8AfyWAAAp5B_.jpg"
    },
    {
      "date": "2018-01-25 18:03:29",
      "URL": "https://pbs.twimg.com/media/DUZ8AcRW4AU4tNt.jpg"
    },
    {
      "date": "2018-01-25 18:03:29",
      "URL": "https://pbs.twimg.com/media/DUZ8AcTX4AIxSKp.jpg"
    },
    {
      "date": "2018-01-25 17:25:53",
      "URL": "https://pbs.twimg.com/media/DUZzYOsW0AEt7V6.jpg"
    },
    {
      "date": "2018-01-25 17:25:53",
      "URL": "https://pbs.twimg.com/media/DUZzYOpWkAAuAoO.jpg"
    },
    {
      "date": "2018-01-25 17:25:53",
      "URL": "https://pbs.twimg.com/media/DUZzYOnW0AEwxfv.jpg"
    },
    {
      "date": "2018-01-25 17:25:53",
      "URL": "https://pbs.twimg.com/media/DUZzYOuWkAAeBzD.jpg"
    },
    {
      "date": "2018-01-24 22:51:20",
      "URL": "https://pbs.twimg.com/media/DUVy6SfW0AAkrwM.jpg"
    }
  ],
  "profile_picture_url": "https://pbs.twimg.com/profile_images/874276197357596672/kUuht00m.jpg",
  "retweets": [
    {
      "date": "2018-01-21 12:20:19",
      "text": "RT Democrats are holding our Military hostage over their desire to have unchecked illegal immigration. Can't let that hap…"
    },
    {
      "date": "2018-01-21 02:34:52",
      "text": "RT .\"My father was elected for one reason, and that's because he actually believes in putting America first, which is…"
    },
    {
      "date": "2018-01-21 02:33:09",
      "text": "RT .\"Since took office, 863,000 new jobs were filled by women. Over half a million American women have en…"
    },
    {
      "date": "2018-01-21 02:31:28",
      "text": "RT .\"Let's look at the calendar. It's January 20th. DACA expires on March 5th. That means this was a construct of…"
    },
    {
      "date": "2018-01-21 02:31:07",
      "text": "RT .\"People have seen a year that's incredible, that's been filled with nothing but the best for our country, America…"
    },
    {
      "date": "2018-01-21 00:40:18",
      "text": "RT Democrats are far more concerned with Illegal Immigrants than they are with our great Military or Safety at our danger…"
    }
  ]
}